ГТС/УТГТС/Documents/ОперацииОтделаСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОперацииОтделаСервиса</Name>
			<BasedOn>
				<xr:Item>Catalog.СделкиСКлиентами</xr:Item>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСервиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатраченноеВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНаДорогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеГарантии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлановойГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяОтправкиЗадания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаданияСервису</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаданийСервиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияСервисом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланируемойГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийПолучено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийОтложено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийВыполнено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладГотовности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонтаОбслуживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРемонтаИОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НужнаАрендаТехники</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВыполненияРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нормативноевремянаработу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РемонтируемаяНоменклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыполненныеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Техника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Мастера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мастер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/Enums/ВариантыОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОбеспечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдалитьОтгрузитьОбособленно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервироватьПоМереПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОбособленно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданРанее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТребуется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/СтатусыЗаданийСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаданийСервиса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/КомпанияЧастноеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КомпанияЧастноеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Компания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Documents/ОперацииОтделаСервиса/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВидРаботыПриИзменении(Элемент)
	УстановитьВидимость();		
КонецПроцедуры

Процедура УстановитьВидимость()	
	Если Объект.ВидРаботы = Справочники.ВидыРаботСервиса.ПредпродажнаяПодготовка Тогда  
		Объект.ВидРаботы = Справочники.ВидыРаботСервиса.ПодготовкаТехники;
		УстановитьВидимость();
		//Элементы.Группа1.Видимость = Ложь;
		//Элементы.Группа2.Видимость = Ложь;
		//Элементы.ЗатраченноеВремя.Видимость = Истина;
		//Элементы.ГруппаВыполненныеРаботы.Видимость = Истина;
		//Элементы.ГруппаРемонтируемаяНоменклатура.Видимость = Истина;
		//Элементы.Группа3.Видимость = Истина;
		//Элементы.ГруппаТехника.Видимость=Ложь;
		//Элементы.Группа4.Видимость=Ложь;
		
	ИначеЕсли Объект.ВидРаботы  = Справочники.ВидыРаботСервиса.ПродажаЗапчастей Тогда  
		Объект.ВидРаботы = Справочники.ВидыРаботСервиса.Ремонт;
		УстановитьВидимость();	
		//Элементы.Группа1.Видимость = Ложь;
		//Элементы.Группа2.Видимость = Истина;
		//Элементы.ГруппаВыполненныеРаботы.Видимость= Истина;
		//
		//Элементы.ЗатраченноеВремя.Видимость = Истина;
		//Элементы.ГруппаРемонтируемаяНоменклатура.Видимость = Ложь; 		
		//Элементы.Группа3.Видимость = Истина;
		//Элементы.ГруппаТехника.Видимость=Ложь;
		//Элементы.Группа4.Видимость=Ложь;
		
	ИначеЕсли Объект.ВидРаботы  = Справочники.ВидыРаботСервиса.ОбслуживаниеКомпании Тогда 
		Объект.ВидРаботы = Справочники.ВидыРаботСервиса.Ремонт;
		УстановитьВидимость();
		//Элементы.Группа1.Видимость = Ложь;
		//Элементы.Группа2.Видимость = Ложь;
		//Элементы.ЗатраченноеВремя.Видимость = Истина;
		//Элементы.ГруппаВыполненныеРаботы.Видимость = Ложь;
		//Элементы.ГруппаРемонтируемаяНоменклатура.Видимость = Ложь;	
		//Элементы.Группа3.Видимость = Истина;
		//Элементы.ГруппаТехника.Видимость=Ложь;
		//Элементы.Группа4.Видимость=Ложь;
		
	ИначеЕсли Объект.ВидРаботы  = Справочники.ВидыРаботСервиса.Ремонт Тогда
		Элементы.Группа1.Видимость = Истина;
		Элементы.Группа2.Видимость = Истина;
		Элементы.ЗатраченноеВремя.Заголовок = "Время на ремонт (чел/час)";
		Элементы.ЗатраченноеВремя.Видимость = Истина;
		Элементы.ГруппаВыполненныеРаботы.Видимость = Истина;
		Элементы.ГруппаРемонтируемаяНоменклатура.Видимость = Истина;
		Элементы.Группа3.Видимость = Истина;
		Элементы.ГруппаТехника.Видимость=Ложь;
		Элементы.Группа4.Видимость=Ложь; 
		Элементы.Комментарий.Видимость=Истина;
		Элементы.ДатаЗавершенияРабот.Видимость=Истина;
		
	ИначеЕсли Объект.ВидРаботы=Справочники.ВидыРаботСервиса.ПодготовкаТехники ИЛИ Объект.ВидРаботы=Справочники.ВидыРаботСервиса.УстановкаДопоборудования  Тогда
		
		Элементы.ГруппаШапка.Видимость=Истина;
		Элементы.Группа1.Видимость=Ложь;
		Элементы.Группа2.Видимость=Ложь;
		Элементы.Группа3.Видимость=Истина;
		Элементы.ГруппаВыполненныеРаботы.Видимость=Истина;
		Элементы.ГруппаРемонтируемаяНоменклатура.Видимость=Ложь;
		Элементы.ГруппаТехника.Видимость=Истина;
		Элементы.Группа4.Видимость=Истина;      
		Элементы.ВыездНаСборку.Видимость=Ложь;
		Элементы.ДатаЗавершенияРабот.Видимость=Ложь; 
		Элементы.Комментарий.Видимость=Ложь;
	ИначеЕсли Объект.ВидРаботы=Справочники.ВидыРаботСервиса.СборкаТехникиНаВыезде  Тогда
		Элементы.ГруппаШапка.Видимость=Истина;
		Элементы.Группа1.Видимость=Ложь;
		Элементы.Группа2.Видимость=Ложь;
		Элементы.Группа3.Видимость=Истина;
		Элементы.ГруппаВыполненныеРаботы.Видимость=Истина;
		Элементы.ГруппаРемонтируемаяНоменклатура.Видимость=Ложь;
		Элементы.ГруппаТехника.Видимость=Истина;
		Элементы.Группа4.Видимость=Истина;  
		Элементы.ДатаПлановойГотовности.Заголовок="Планируемая дата выезда";
		Элементы.ВыездНаСборку.Видимость=истина;
		Элементы.ДатаЗавершенияРабот.Видимость=Ложь;


	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимость();
	УстановитьДоступность();
	Если Параметры.Ключ.Пустая() Тогда
	СклПоУмолч=Справочники.Склады.НайтиПоНаименованию("Склад Подольск",Истина);
	СклСервиса=Справочники.Склады.НайтиПоНаименованию("Склад Сервиса - Подольск",Истина);
    Если Объект.ВидРаботы=Справочники.ВидыРаботСервиса.Ремонт Тогда
	СклПоУмолч=СклСервиса;
	КонецЕсли;
	Объект.Склад=СклПоУмолч;
	Объект.СкладГотовности=СклПоУмолч; 
	КонецЕсли;
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов  
	
	
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
		ГиперссылкаФайлов = МодульРаботаСФайлами.ГиперссылкаФайлов();
		ГиперссылкаФайлов.Размещение = "КоманднаяПанель";
		МодульРаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами

	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);


КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ПодборТоваров(Команда)
	
	СтруктураПараметров = ПолучитьСтруктуруПараметров();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ",   Объект.Ссылка);
	ПараметрыФормы.Вставить("Партнер",    Объект.Партнер);
	ПараметрыФормы.Вставить("Соглашение", СтруктураПараметров.Соглашение);
	ПараметрыФормы.Вставить("Склад",      Объект.Склад);
	ПараметрыФормы.Вставить("Валюта",     СтруктураПараметров.Валюта);
	ПараметрыФормы.Вставить("Дата",       Объект.Дата);
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров",				Ложь);
	ПараметрыФормы.Вставить("РегистрироватьЦеныПоУсловиям",                 	Ложь);
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", 	Ложь);
	ПараметрыФормы.Вставить("РежимПодбораИсключитьГруппыДоступныеВЗаказах",  	Ложь);
	ПараметрыФормы.Вставить("РежимПодбораБезУслуг",                          	Ложь);
	Если Элементы.ВидРаботы.ТекстРедактирования ="Продажа запчастей" Тогда
		Элементы.Страницы.ТекущаяСтраница=Элементы.ГруппаВыполненныеРаботы;
	ИначеЕсли Элементы.ВидРаботы.ТекстРедактирования ="Подготовка техники" Тогда
		Элементы.Страницы.ТекущаяСтраница=Элементы.ГруппаТехника;
		
		
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПараметров()
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("Соглашение", Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("СЛУЖЕБНОЕ",Истина));
	СтруктураПараметров.Вставить("Склад",      Справочники.Склады.ПустаяСсылка());
	СтруктураПараметров.Вставить("Валюта",     Константы.ВалютаРегламентированногоУчета.Получить());
	
	Возврат СтруктураПараметров
	
КонецФункции	

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ИмяТабличнойЧасти = ЭтаФорма.ТекущийЭлемент.Имя;
	Адрес = ВыбранноеЗначение.АдресТоваровВХранилище;
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "ГруппаРемонтируемаяНоменклатура" Тогда
		ИмяТабличнойЧасти = "РемонтируемаяНоменклатура";
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя = "ГруппаВыполненныеРаботы" Тогда	
		ИмяТабличнойЧасти = "ВыполненныеРаботы";
	КонецЕсли;	
	ЗаполнитьТЧИзВыбора(Адрес, ИмяТабличнойЧасти);	
КонецПроцедуры

Процедура ЗаполнитьТЧИзВыбора(Адрес, ИмяТЧ)
	Товары = ПолучитьИзВременногоХранилища(Адрес);
	Для Каждого СтрокаТЧ Из Товары Цикл
		НоваяСтрока = Объект[ИмяТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ПолученоСервисом(Команда)
	ПолученоСервисомНаСервере();
	ОбновитьОтображениеДанных(); 
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура Отложено(Команда)
	Если Элементы.ДатаПланируемойГотовности.ВыделенныйТекст="  .  .    " Тогда
		Сообщ=Новый СообщениеПользователю;
		Сообщ.Текст="Укажите дату планируемой готовности";
		Сообщ.Сообщить();
	Иначе
		ОтложеноНаСервере();
		ОбновитьОтображениеДанных(); 
		УстановитьДоступность();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Выполнено(Команда)
	
	//АСист-Про       
	Если НЕ ПроверитьДатуЗавершенияНаСервере() Тогда
		// Если она не заполнена, сообщим об этом пользователю
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнена дата завершения работ или время на работу !";
		Сообщение.Поле = "ДатаЗавершенияРабот1";
		Сообщение.УстановитьДанные(ЭтаФорма);
		
		Сообщение.Сообщить();
		
		Возврат
	КонецЕсли;
	Если НЕ ПроверитьЗаполненностьСкладаГотовностиНаСервере() Тогда
		// Если он не заполнен, сообщим об этом пользователю
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указан ""Склад готовности"" !";
		Сообщение.Поле = "СкладГотовности";
		Сообщение.УстановитьДанные(ЭтаФорма);
		
		Сообщение.Сообщить();
		
		Возврат
	КонецЕсли;
	
	ВыполненоСервисомНаСервере();
	ОбновитьОтображениеДанных(); 
	УстановитьДоступность();
	
КонецПроцедуры


&НаСервере
Функция ПроверитьДатуЗавершенияНаСервере() 
	Если Не ЗначениеЗаполнено(Объект.ДатаЗавершенияРабот) ИЛИ НЕ ЗначениеЗаполнено(Объект.ЗатраченноеВремя)  Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

  КонецФункции

&НаКлиенте
Процедура ОтправитьВСервис(Команда)
	Если Элементы.ДатаПлановойГотовности.ВыделенныйТекст="  .  .    " Тогда
		Сообщ=Новый СообщениеПользователю;
		Сообщ.Текст="Укажите дату плановой готовности";
		Сообщ.Сообщить();
	ИначеЕсли КомментарийМенеджера="" И Объект.Комментарий="" И Объект.КомментарийМенеджера="" Тогда
		Сообщ=Новый СообщениеПользователю;
		Сообщ.Текст="Укажите комментарий по подготовке техники";
		Сообщ.Сообщить(); 
	ИначеЕсли строка(Элементы.СкладГотовности)="" Тогда
		Сообщ=Новый СообщениеПользователю;
		Сообщ.Текст="Укажите склад по подготовке техники";
		Сообщ.Сообщить();
	ИначеЕсли НЕ ПроверитьРезервТехники() Тогда
		Сообщ=Новый СообщениеПользователю;
		Сообщ.Текст="Техника должна быть в резерве на складе готовности";
		Сообщ.Сообщить();
	Иначе
		ОтправитьВСервисНаСервере();
		ОбновитьОтображениеДанных(); 
		УстановитьДоступность() ;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполненностьСкладаГотовностиНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.СкладГотовности) И (Объект.ВидРаботы = Справочники.ВидыРаботСервиса.ПодготовкаТехники ИЛИ  Объект.ВидРаботы = Справочники.ВидыРаботСервиса.УстановкаДопоборудования ИЛИ Объект.ВидРаботы=Справочники.ВидыРаботСервиса.СборкаТехникиНаВыезде) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
	
КонецФункции

&НаСервере
Функция ПроверитьРезервТехники() 
	Если ЗначениеЗаполнено(Объект.ДокументОснование) И Объект.ВидРаботы<>Справочники.ВидыРаботСервиса.СборкаТехникиНаВыезде Тогда
		Для каждого СтрТехника из Объект.Техника Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
			|	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
			|	ЗаказКлиентаТовары.Склад КАК Склад
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|ГДЕ
			|	ЗаказКлиентаТовары.Номенклатура = &Номенклатура
			|	И ЗаказКлиентаТовары.ВариантОбеспечения = &ВариантОбеспечения
			|	И ЗаказКлиентаТовары.Склад = &Склад
			|	И ЗаказКлиентаТовары.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
		Запрос.УстановитьПараметр("Номенклатура", СтрТехника.Номенклатура);
		Запрос.УстановитьПараметр("ВариантОбеспечения", Перечисления.ВариантыОбеспечения.СоСклада);
		Запрос.УстановитьПараметр("Склад", Объект.СкладГотовности);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат Истина;
		КонецЦикла;
		
		Возврат Ложь;
		КонецЦикла;  
	Иначе 
		Возврат Истина; 
	КонецЕсли;
		
КонецФункции


&НаСервере
Процедура ОтправитьВСервисНаСервере()
	Об=РеквизитФормыВЗначение("Объект");
	Об.МенеджерСервис=ПараметрыСеанса.ТекущийПользователь;
	Об.ДатаиВремяОтправкиЗадания=ТекущаяДата();
	Об.СтатусЗаданияСервису=Перечисления.СтатусыЗаданийСервиса.Отправлено;
	Об.Записать();
	ЗначениеВРеквизитФормы(Об,"Объект");
	
	БП = БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
	БП.Автор = ПараметрыСеанса.ТекущийПользователь;
	БП.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
	БП.СрокИсполнения = Об.ДатаПлановойГотовности;
	БП.Дата = ТекущаяДата();
	БП.Исполнитель = Константы.ИсполнительОтделаСервиса.Получить();
	БП.Наименование = "Нужно подготовить технику";
	БП.Содержание = "Комментарий менеджера: "+Об.КомментарийМенеджера;
	БП.Предмет=Об.Ссылка;
	БП.Состояние=Перечисления.СостоянияБизнесПроцессов.Активен;
	БП.Записать();
	БП.Старт();
КонецПроцедуры
&НаСервере
Процедура   ПолученоСервисомНаСервере()
	
	Об=РеквизитФормыВЗначение("Объект");
	Об.ДатаПолученияСервисом=ТекущаяДата();
	Об.СтатусЗаданияСервису=Перечисления.СтатусыЗаданийСервиса.Получено;
	Об.Записать();
	ЗначениеВРеквизитФормы(Об,"Объект");
	
КонецПроцедуры

&НаСервере
Процедура   ОтложеноНаСервере()
	Об=РеквизитФормыВЗначение("Объект");
	Об.СтатусЗаданияСервису=Перечисления.СтатусыЗаданийСервиса.Отложено;
	Об.Записать();
	ЗначениеВРеквизитФормы(Об,"Объект");
	БП = БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
	БП.Автор = ПараметрыСеанса.ТекущийПользователь;
	БП.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
	БП.Дата = ТекущаяДата();
	БП.Исполнитель = Об.МенеджерСервис;
	БП.Наименование = "Подготовка техники отложена";
	БП.Содержание = "Изначальная дата: "+Об.ДатаПлановойГотовности+" изменилась на: "+Об.ДатаПланируемойГотовности+ " Комментарий: "+Об.КомментарийОтложено;
	БП.Предмет=Об.Ссылка;
	БП.Состояние=Перечисления.СостоянияБизнесПроцессов.Активен;
	БП.Записать();
	БП.Старт();
	
	
КонецПроцедуры

&НаСервере
Процедура   ВыполненоСервисомНаСервере()
	
	Об=РеквизитФормыВЗначение("Объект");
	Об.ДатаВремяГотовности=ТекущаяДата();
	Об.СтатусЗаданияСервису=Перечисления.СтатусыЗаданийСервиса.Выполнено;
	Об.Записать();
	ЗначениеВРеквизитФормы(Об,"Объект");
	БП = БизнесПроцессы.Задание.СоздатьБизнесПроцесс();
	БП.Автор = ПараметрыСеанса.ТекущийПользователь;
	БП.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
	БП.Дата = ТекущаяДата();
	БП.Исполнитель = Об.МенеджерСервис;
	БП.Наименование = "Техника подготовлена";
	БП.Содержание = "Комментарий сервиса: "+Об.КомментарийВыполнено;
	БП.Предмет=Об.Ссылка;
	БП.Состояние=Перечисления.СостоянияБизнесПроцессов.Активен;
	БП.Записать();
	БП.Старт();
	
КонецПроцедуры

Процедура УстановитьДоступность()
	Если РольДоступна("ПолныеПрава") или РольДоступна("ASP_УправлениеСервиснымиОперациями") Тогда
		Если Объект.СтатусЗаданияСервису=ПредопределенноеЗначение("Перечисление.СтатусыЗаданийСервиса.Отправлено") Тогда
			
			Элементы.Группа7.Доступность=Истина;
		ИначеЕсли Объект.СтатусЗаданияСервису=ПредопределенноеЗначение("Перечисление.СтатусыЗаданийСервиса.Получено") Тогда
			Элементы.Группа7.Доступность=Ложь;
			Элементы.Группа8.Доступность=Истина;
			Элементы.Группа9.Доступность=Истина;
		ИначеЕсли Объект.СтатусЗаданияСервису=ПредопределенноеЗначение("Перечисление.СтатусыЗаданийСервиса.Отложено") Тогда
			Элементы.Группа9.Доступность=Истина;
			Элементы.Группа8.Доступность=Ложь;
		ИначеЕсли Объект.СтатусЗаданияСервису=ПредопределенноеЗначение("Перечисление.СтатусыЗаданийСервиса.Выполнено") Тогда
			Элементы.Группа9.Доступность=Ложь;
			
			
		КонецЕсли;
	КонецЕсли;
	Если Не ПустаяСтрока(Объект.СтатусЗаданияСервису) Тогда
		Элементы.Группа5.Доступность=Ложь;
	КонецЕсли;
	Если Объект.СтатусЗаданияСервису=ПредопределенноеЗначение("Перечисление.СтатусыЗаданийСервиса.Выполнено") Тогда
		Элементы.Группа6.Доступность=Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзСделки(Команда)
	Если Не ПустаяСтрока(Элементы.ДокументОснование) Тогда
		ЗаполнитьИзСделкиНаСервере();
	Иначе
		Сообщ=Новый СообщениеПользователю;
		Сообщ.Текст="Не выбран документ-основание";
		Сообщ.Сообщить();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура   ЗаполнитьИзСделкиНаСервере()
	Об=РеквизитФормыВЗначение("Объект");
	Об.Техника.Очистить();
	Тов=Об.ДокументОснование.Товары.Выгрузить();
	Об.Техника.Загрузить(Тов);
	ЗначениеВРеквизитФормы(Об,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СкладГотовностиПриИзменении(Элемент)
	Объект.Склад=Объект.СкладГотовности;
КонецПроцедуры



&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ВидРаботы=Справочники.ВидыРаботСервиса.Ремонт И НЕ ЗначениеЗаполнено(Объект.ПричинаОбращения) Тогда
		Сообщить ("Заполните причину обращения"); 
		Отказ=Истина;
	КонецЕсли;
    Если ТекущийОбъект.ВидРаботы=Справочники.ВидыРаботСервиса.Ремонт И НЕ ЗначениеЗаполнено(Объект.ВидРемонтаОбслуживания) Тогда
		Сообщить ("Выберите вид Ремонта/ТО");
		Отказ=Истина;
	КонецЕсли; 
	
	 Если ТекущийОбъект.ВидРаботы=Справочники.ВидыРаботСервиса.Ремонт И НЕ ЗначениеЗаполнено(Объект.СтатусЗаданияСервису) Тогда
		Сообщить ("Выберите статус ремонта");
		Отказ=Истина;
	КонецЕсли;
    Если ТекущийОбъект.ВидРаботы=Справочники.ВидыРаботСервиса.Ремонт И НЕ ЗначениеЗаполнено(Объект.КонтактноеЛицо) И Объект.Партнер.ЮрФизЛицо=Перечисления.КомпанияЧастноеЛицо.Компания Тогда
		Сообщить ("Выберите контактное лицо");
		Отказ=Истина;
	КонецЕсли;
	 Если ТекущийОбъект.ВидРаботы=Справочники.ВидыРаботСервиса.Ремонт И НЕ ЗначениеЗаполнено(Объект.Комментарий) Тогда
		Сообщить ("Укажите комментарий");
		Отказ=Истина;
	КонецЕсли;  
	 Если ТекущийОбъект.ВидРаботы=Справочники.ВидыРаботСервиса.Ремонт И Объект.НаличиеГарантии И НЕ ЗначениеЗаполнено(Объект.ДатаВыдачи) Тогда
		Сообщить ("Укажите дату выдачи гарантии");
		Отказ=Истина;
	КонецЕсли;
	Если ТекущийОбъект.ВидРаботы=Справочники.ВидыРаботСервиса.Ремонт И Объект.СтатусЗаданияСервису=перечисления.СтатусыЗаданийСервиса.Выполнено Тогда 
		Если НЕ ВыполнитьПроверкуНаличияГарантии() Тогда
			Отказ=Истина;
			Сообщить ("Укажите серийный номер ремонтируемой техники");
		КонецЕсли;  
		Если НЕ ЗначениеЗаполнено(Объект.МестоВыполненияРабот) Тогда
			Отказ=Истина;
			Сообщить ("Заполните место выполнения работы");
		КонецЕсли;
		Если Объект.МестоВыполненияРабот="На выезде" И Объект.ВремяНаДорогу=0 Тогда
			Отказ=Истина;
			Сообщить ("Укажите время на дорогу");
		КонецЕсли;
    КонецЕсли;
	Если ТекущийОбъект.СтатусЗаданияСервису=Перечисления.СтатусыЗаданийСервиса.Выполнено И Объект.Мастера.Количество()=0 Тогда
		Отказ=Истина;
		Сообщить ("Укажите мастеров выполнявших работу")	
	КонецЕсли;
	Если ТекущийОбъект.СтатусЗаданияСервису=Перечисления.СтатусыЗаданийСервиса.Выполнено И НЕ ЗначениеЗаполнено(Объект.ДатаЗавершенияРабот) Тогда
		Отказ=Истина;
		Сообщить ("Укажите дату завершения работ")	
	КонецЕсли; 
	Если ТекущийОбъект.СтатусЗаданияСервису=Перечисления.СтатусыЗаданийСервиса.Выполнено И НЕ ЗначениеЗаполнено(Объект.ЗатраченноеВремя) Тогда
		Отказ=Истина;
		Сообщить ("Укажите время на работу")	
	КонецЕсли;
	СвойствоНормочасы = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Количество нормо-часов (Услуга)");
	ТекущийОбъект.Мастера.Свернуть("Мастер");	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры              


// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);

КонецПроцедуры             


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура РемонтируемаяНоменклатураСерийныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 СтандартнаяОбработка = Ложь;
    //получение списка контрагентов выносим в отдельную функцию, выполняемую &НаСервере
     ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаВыбора", Новый Структура("Номенклатура",Элементы.РемонтируемаяНоменклатура.ТекущиеДанные.Номенклатура), Элемент);

КонецПроцедуры


&НаСервере
Функция ВыполнитьПроверкуНаличияГарантии()    
	
	Итог=Истина;
	Если Объект.Дата>='20231001' 
		Тогда
		ОбъектФормы = РеквизитФормыВЗначение("Объект");
		Товары=ОбъектФормы.РемонтируемаяНоменклатура.Выгрузить();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТЧ.Номенклатура КАК Номенклатура,
		               |	ТЧ.СерийныйНомер КАК СерийныйНомер
		               |ПОМЕСТИТЬ ТЧ
		               |ИЗ
		               |	&ТЧ КАК ТЧ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТЧ.Номенклатура КАК Номенклатура,
		               |	Номенклатура1.ВидНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии,
		               |	ТЧ.СерийныйНомер КАК СерийныйНомер
		               |ИЗ
		               |	ТЧ КАК ТЧ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
		               |		ПО ТЧ.Номенклатура = Номенклатура1.Ссылка
		               |ГДЕ
		               |	Номенклатура1.ВидНоменклатуры.ИспользоватьСерии = ИСТИНА
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТЧ.Номенклатура,
		               |	Номенклатура1.ВидНоменклатуры.ИспользоватьСерии,
		               |	ТЧ.СерийныйНомер";
		Запрос.УстановитьПараметр("ТЧ", Товары);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.СерийныйНомер) И Выборка.ИспользоватьСерии=Истина Тогда
				Итог=Ложь;
				Прервать; 
				Иначе 
				Итог=Истина;
				Прервать;
		КонецЕсли;	
        КонецЦикла;
        Возврат Итог;
	КонецЕсли;  
	Возврат Итог;
КонецФункции
